export const STACKS = [
  {
    id: "Docker",
    title: "Docker",
    description:
      "Работа команды с Docker значительно повышает эффективность и стабильность процесса разработки и деплоя приложений. Контейнеризация позволяет создавать воспроизводимую среду исполнения, минимизируя риск возникновения проблем совместимости. Возможность упаковать приложение вместе с зависимостями в единый образ упрощает передачу проекта новым участникам команды и третьим лицам.",
  },
  {
    id: "Kafka",
    title: "Kafka",
    description:
      "Kafka — распределённая стриминговая платформа, которая обеспечивает высоконагруженную, масштабируемую и отказоустойчивую обработку событий. Широко применяется в микросервисной архитектуре и системах реального времени.",
  },
  {
    id: "Redis",
    title: "Redis",
    description:
      "Redis — это сверхбыстрая in-memory база данных, подходящая для кеширования, очередей задач и хранения сессий. Простой и лаконичный синтаксис команд делает её удобной для разработчиков.",
  },
  {
    id: "Go",
    title: "Go",
    description:
      "Go — минималистичный и производительный язык программирования от Google. Отлично подходит для высоконагруженных систем, микросервисов и CLI-инструментов благодаря своей скорости, типизации и лёгкости компиляции.",
  },
];
